/*
 * 프로그램
 * 1. 데이터 저장
 *   변수 / 상수 (변하지 않는 수)
 *   --- 변하는 수 ( 필요한 경우 변경이 가능 )
 *   ==> 저장해야 되는 데이터가 많은 경우
 *       ==> 묶어서 저장
 *            배열 / 클래스 (사용자 정의)
 *      ---------------------------- 메모리에 저장
 *                                   ----- RAM
 *      ==> 사라지지 않는 저장값 : 파일 / DataBase(오라클)
 *      -----------------------------
 *      
 *            
 * 2. 데이터 가공 ( 사용자 요청 )
 *    연산자 , 제어문
 *    ------------ 메소드
 *    함수(C,C++)/메소드(***  기술면접) => 포트폴리오
 *    --------   java,/C#
 *       |     코틀린/파이썬
 *             def 함수
 *             func 함수명
 *       클래스 종속
 * 3. 가공된 데이터 출력
 * = Application(windows,dos) => main
 * = Web Application(브라우저) => main(x)
 * ----------------- 관련된 내용을 묶어서 관리
 * 
 * 
 * 4. 자바 : 데이터 관리, 브라우저 전송 , 오라클 연동
 *          ------------------------------
 * 5. 라이브러리
 *    java.util, java.io, java.net => 기타
 *    mvnrepository.com
 *    -----------------
 * 6. 조립법
 * ---------------------------------------
 * 7. 알고리즘, 디자인 패턴 => 코테 관련
 * ---------------------------------------
 * 
 * */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
	}

}
